backend/views/allocation/_form.php

    ]) ?>

    <?php
    	$status = Syscode::find()->where(['majorcode'=>'status'])->all();
---
SELECT * FROM `syscode` WHERE `majorcode`='whether'