backend/controllers/AllocationController.php

INSERT INTO `allocation` (`filename`, `filecontent`, `isshare`, `lid`, `status`, `oid`) VALUES ('222', '22', '6', '1', '9', '1')
---
    public function actionCreate()
    {
        $model = new Allocation();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `allocation` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Allocation::findOne($id)) !== null) {