backend/controllers/SyscodeController.php

    protected function findModel($id)
    {
        if (($model = Syscode::findOne($id)) !== null) {
---
SELECT * FROM `syscode` WHERE `id`='5'