frontend/controllers/AdviserController.php

SELECT * FROM `adviser` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Adviser::findOne($id)) !== null) {